Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70a/edc/ATSAMS70N21.PIC
      <edc:SFRDef edc:_addr="0x4002C0E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="US_WPSR" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4002C0EC" edc:offset="0xBF14"/>
      <edc:SFRDef edc:_addr="0x40038000" edc:access="---------------nnnnnnnnnnnnnnnnn" edc:cname="USBHS_DEVCTRL" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="UADD" edc:desc="USB Address" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="Address Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DETACH" edc:desc="Detach" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RMWKUP" edc:desc="Remote Wake-Up" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPDCONF" edc:desc="Mode Configuration" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="The peripheral starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the host is high-speed-capable." edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LOW_POWER" edc:desc="For a better consumption, if high speed is not needed." edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LS" edc:desc="Low-Speed Mode Force" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSTJ" edc:desc="Test mode J" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSTK" edc:desc="Test mode K" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSTPCKT" edc:desc="Test packet mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="Specific Operational mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038004" edc:access="rrrrrrr-rrrrrrrrrrrr-----rrrrrrr" edc:cname="USBHS_DEVISR" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SUSP" edc:desc="Suspend Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MSOF" edc:desc="Micro Start of Frame Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOF" edc:desc="Start of Frame Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EORST" edc:desc="End of Reset Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:desc="Wake-Up Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EORSM" edc:desc="End of Resume Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPRSM" edc:desc="Upstream Resume Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PEP_0" edc:desc="Endpoint 0 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_1" edc:desc="Endpoint 1 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_2" edc:desc="Endpoint 2 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_3" edc:desc="Endpoint 3 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_4" edc:desc="Endpoint 4 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_5" edc:desc="Endpoint 5 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_6" edc:desc="Endpoint 6 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_7" edc:desc="Endpoint 7 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_8" edc:desc="Endpoint 8 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_9" edc:desc="Endpoint 9 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_10" edc:desc="Endpoint 10 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_11" edc:desc="Endpoint 11 Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:desc="DMA Channel 1 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:desc="DMA Channel 2 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:desc="DMA Channel 3 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:desc="DMA Channel 4 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:desc="DMA Channel 5 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:desc="DMA Channel 6 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:desc="DMA Channel 7 Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038008" edc:access="-------------------------wwwwwww" edc:cname="USBHS_DEVICR" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SUSPC" edc:desc="Suspend Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MSOFC" edc:desc="Micro Start of Frame Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOFC" edc:desc="Start of Frame Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EORSTC" edc:desc="End of Reset Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKEUPC" edc:desc="Wake-Up Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EORSMC" edc:desc="End of Resume Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPRSMC" edc:desc="Upstream Resume Interrupt Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003800C" edc:access="wwwwwww------------------wwwwwww" edc:cname="USBHS_DEVIFR" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SUSPS" edc:desc="Suspend Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MSOFS" edc:desc="Micro Start of Frame Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOFS" edc:desc="Start of Frame Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EORSTS" edc:desc="End of Reset Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKEUPS" edc:desc="Wake-Up Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EORSMS" edc:desc="End of Resume Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPRSMS" edc:desc="Upstream Resume Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x12"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:desc="DMA Channel 1 Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:desc="DMA Channel 2 Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:desc="DMA Channel 3 Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:desc="DMA Channel 4 Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:desc="DMA Channel 5 Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:desc="DMA Channel 6 Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:desc="DMA Channel 7 Interrupt Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
