Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70a/edc/ATSAMS70N21.PIC
      <edc:SFRDef edc:_addr="0x4004C00C" edc:access="------------------------nnnnnnnn" edc:cname="ISI_PDECF" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DEC_FACTOR" edc:desc="Decimation Factor" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C010" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ISI_Y2R_SET0" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="C0" edc:desc="Color Space Conversion Matrix Coefficient C0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="C1" edc:desc="Color Space Conversion Matrix Coefficient C1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="C2" edc:desc="Color Space Conversion Matrix Coefficient C2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="C3" edc:desc="Color Space Conversion Matrix Coefficient C3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C014" edc:access="-----------------nnn---nnnnnnnnn" edc:cname="ISI_Y2R_SET1" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="C4" edc:desc="Color Space Conversion Matrix Coefficient C4" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="Yoff" edc:desc="Color Space Conversion Luminance Default Offset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Croff" edc:desc="Color Space Conversion Red Chrominance Default Offset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Cboff" edc:desc="Color Space Conversion Blue Chrominance Default Offset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C018" edc:access="-------n-nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="ISI_R2Y_SET0" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="C0" edc:desc="Color Space Conversion Matrix Coefficient C0" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C1" edc:desc="Color Space Conversion Matrix Coefficient C1" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C2" edc:desc="Color Space Conversion Matrix Coefficient C2" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="Roff" edc:desc="Color Space Conversion Red Component Offset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C01C" edc:access="-------n-nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="ISI_R2Y_SET1" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="C3" edc:desc="Color Space Conversion Matrix Coefficient C3" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C4" edc:desc="Color Space Conversion Matrix Coefficient C4" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C5" edc:desc="Color Space Conversion Matrix Coefficient C5" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="Goff" edc:desc="Color Space Conversion Green Component Offset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C020" edc:access="-------n-nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="ISI_R2Y_SET2" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="C6" edc:desc="Color Space Conversion Matrix Coefficient C6" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C7" edc:desc="Color Space Conversion Matrix Coefficient C7" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C8" edc:desc="Color Space Conversion Matrix Coefficient C8" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="Boff" edc:desc="Color Space Conversion Blue Component Offset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C024" edc:access="-----------------------w-----www" edc:cname="ISI_CR" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ISI_EN" edc:desc="ISI Module Enable Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ISI_DIS" edc:desc="ISI Module Disable Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ISI_SRST" edc:desc="ISI Software Reset Request" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ISI_CDC" edc:desc="ISI Codec Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C028" edc:access="----rrrr----r-rr-----r-r-----rrr" edc:cname="ISI_SR" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Module Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIS_DONE" edc:desc="Module Disable Request has Terminated (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRST" edc:desc="Module Software Reset Request has Terminated (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CDC_PND" edc:desc="Pending Codec Request" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VSYNC" edc:desc="Vertical Synchronization (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PXFR_DONE" edc:desc="Preview DMA Transfer has Terminated (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CXFR_DONE" edc:desc="Codec DMA Transfer has Terminated (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SIP" edc:desc="Synchronization in Progress" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="P_OVR" edc:desc="Preview Datapath Overflow (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_OVR" edc:desc="Codec Datapath Overflow (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC_ERR" edc:desc="CRC Synchronization Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FR_OVR" edc:desc="Frame Rate Overrun (cleared on read)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
