Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70a/edc/ATSAMS70N21.PIC
      <edc:SFRDef edc:_addr="0x400E186C" edc:access="--nnnnnnnnnnnnnnnnnnnnnn-nnnnnnn" edc:cname="RTC_CALR" edc:nzwidth="0x20" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CENT" edc:desc="Current Century" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="YEAR" edc:desc="Current Year" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="MONTH" edc:desc="Current Month" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="DAY" edc:desc="Current Day in Current Week" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DATE" edc:desc="Current Day in Current Month" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1870" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RTC_TIMALR" edc:nzwidth="0x20" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEC" edc:desc="Second Alarm" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="SECEN" edc:desc="Second Alarm Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIN" edc:desc="Minute Alarm" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="MINEN" edc:desc="Minute Alarm Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HOUR" edc:desc="Hour Alarm" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="AMPM" edc:desc="AM/PM Indicator" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HOUREN" edc:desc="Hour Alarm Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1874" edc:access="n-nnnnnnn--nnnnn----------------" edc:cname="RTC_CALALR" edc:nzwidth="0x20" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="MONTH" edc:desc="Month Alarm" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MTHEN" edc:desc="Month Alarm Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATE" edc:desc="Date Alarm" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DATEEN" edc:desc="Date Alarm Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1878" edc:access="--------------------------rrrrrr" edc:cname="RTC_SR" edc:nzwidth="0x20" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ACKUPD" edc:desc="Acknowledge for Update" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FREERUN" edc:desc="Time and calendar registers cannot be updated." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE" edc:desc="Time and calendar registers can be updated." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ALARM" edc:desc="Alarm Flag" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_ALARMEVENT" edc:desc="No alarm matching condition occurred." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ALARMEVENT" edc:desc="An alarm matching condition has occurred." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SEC" edc:desc="Second Event" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_SECEVENT" edc:desc="No second event has occurred since the last clear." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SECEVENT" edc:desc="At least one second event has occurred since the last clear." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TIMEV" edc:desc="Time Event" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_TIMEVENT" edc:desc="No time event has occurred since the last clear." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="TIMEVENT" edc:desc="At least one time event has occurred since the last clear." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CALEV" edc:desc="Calendar Event" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_CALEVENT" edc:desc="No calendar event has occurred since the last clear." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CALEVENT" edc:desc="At least one calendar event has occurred since the last clear." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TDERR" edc:desc="Time and/or Date Free Running Error" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="CORRECT" edc:desc="The internal free running counters are carrying valid values since the last read of the Status Register (RTC_SR)." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ERR_TIMEDATE" edc:desc="The internal free running counters have been corrupted (invalid date or time, non-BCD values) since the last read and/or they are still invalid." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E187C" edc:access="--------------------------wwwwww" edc:cname="RTC_SCCR" edc:nzwidth="0x20" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ACKCLR" edc:desc="Acknowledge Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALRCLR" edc:desc="Alarm Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SECCLR" edc:desc="Second Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMCLR" edc:desc="Time Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CALCLR" edc:desc="Calendar Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TDERRCLR" edc:desc="Time and/or Date Free Running Error Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
