Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70a/edc/ATSAMS70N21.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PA11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QCS" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QIO1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QIO0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA14" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QSCK" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA16" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D15" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA17" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QIO2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD6" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA18" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMEXTRG1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A14" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD7" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA19" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A15" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD8" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="WKUP9" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA20" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A16" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="BA0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD9" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="WKUP10" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA21" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="RXD1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWMFI0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD1" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="PIODCEN2" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA22" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="RK" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMEXTRG1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NCS2" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA23" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SCK1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A19" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA24" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="RTS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A20" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PCK" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA25" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="CTS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A23" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="MCCK" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA26" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="DCD1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCDA2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PWMFI1" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA27" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="DTR1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCDA3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D7" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA28" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="DSR1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCCDA" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PWMFI2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA30" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMEXTRG0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCDA0" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NPCS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCDA1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="RXD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="TF" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AD10" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="RTCOUT0" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TXD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="TK" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AD0" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="RTCOUT1" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="CTS0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="NPCS0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AD5" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="RTS0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AD2" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="WKUP12" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TWD1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TXD1" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TWCK1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB6" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB7" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB8" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB9" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SCK0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DAC0" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DCD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="DAC1" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DTR0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DSR0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD4" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="RI0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="DCD2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="DTR2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="DSR2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="RI2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD8" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMFI1" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD9" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMFI2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="ADTRG" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="D5" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NPCS2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D6" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SDA10" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD14" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SDCKE" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="RXD2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NWR1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="NBS1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD16" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TXD2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="RAS" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD17" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SCK2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="CAS" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD18" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NCS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDCS" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="RTS2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="URXD4" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD19" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NCS3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="CTS2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD4" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD20" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD21" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TIOA11" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D1" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD22" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SPCK" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TIOB11" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD24" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="RF" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TCLK11" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="HSYNC" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD25" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NPCS1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="URXD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="VSYNC" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD26" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="UTXD1" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD27" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NPCS3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TWD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D8" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD28" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="URXD3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TWCK2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D9" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD30" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="UTXD3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D10" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AD0" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QIO3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="UTXD3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D11" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDOUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VREFN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VREFP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NRST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="JTAGSEL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDPLL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDUTMII"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="HSDM"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="HSDP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDANA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDUTMI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDPLLUSB"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDPLL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDUTMIC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VBG"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDPLLUSB"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>